# +: 더하기
# -: 빼기
# *: 곱하기
# /: 나누기

print(7+14) # 21
print(7-14) # -7 (계산 결과가 음수여도 출력 가능)
print(7*14) # 98
print(7/14) # 0.5

print(75+80/2) # 115.0 (나누기 먼저 계산)
print((75+80)/2) # 괄호로 감싸서 계산 순서 지정 가능

print("=================실습. 합/차/평균 계산=================")

print("두 측정값의 합:", 100+55)
print("온도 변화량:", 7)
print("평균 온도:", 77.5)

# 선생님 답
print("두 측정값의 합:", 7+77.5)
print("온도 변화량:", 7)
print("평균 온도:", (7+77.5)/2)

print("=================실습. 만든 코드에 주석을 달아 정리=================")
print(10-50) # 계산 결과가 음수여도 출력이 가능함
print((75+80)/2) # 복잡한 계산식에서는 괄호를 사용하여 계산순서를 지정할 수 있다
print("더하기"+"연산자를"+"사용하면"+"?") # 문자 입력 시 +를 사용하면 해당 문자들을 붙여서 출력할 수 있다.

print("=================================")

