# 간단하게 딕셔너리 예제를 만들어 봅시다
# 보통 리스트 안에 딕셔너리들이 있다면,
# 그 딕셔너리들은 같은 key들을 갖는게 일반적
location_dict = {
    "시": [
        {"이름": "서울특별시", "기초단체": ["종로구", "중구", "마포구"]},
        {"이름": "대구광역시", "기초단체": ["중구", "수성구", "달서구"]},
    ],
    "도": [
        {"이름": "경기도", "기초단체": ["수원시", "안양시", "안산시"]},
        {"이름": "경상북도", "기초단체": ["포항시", "경주시", "김천시"]},
    ],
}

# 전체 출력
print(location_dict)
print("======================================================")

# 시와 도 단위 딕셔너리들을 각각 출력하기
print(location_dict["시"])
print(location_dict.get("도"))
print("======================================================")

# 각 시 도 마다 세부 딕셔너리들을 출력하기
for basic_dict in location_dict.get("시"):
    print(basic_dict)
    print(basic_dict.get("이름"))
    print(basic_dict.get("기초단체"))
print("======================================================")

for basic_dict in location_dict.get("도"):
    print(basic_dict)
    print(basic_dict.get("이름"))
    print(basic_dict.get("기초단체"))

# 위 코드를 보면 두 개의 for문이 사실상 같은 일을 한다
# 그래서 중복되는 부분을 묶고, 다른점만 외부에서 지적해 시키면 돌아가는
# "함수(function)"를 만들면 효율성이 높아진다.
