import numpy as np

a = np.array([70, 72, 71, 95, 73])
print(a[0], a[-1])  # 70 73
print(a[1:4])  # 72, 71, 95

b = np.array([[70, 2.1], [72, 2.3], [71, 1.9]])
print(b.shape)  # (3, 2)
print(b[0])  # [70.   2.1]
print(b[0, 1])  # 2.1
print(b[:, 0])  # [70., 72., 71.]
print(b[:, 1])  # [2.1 2.3 1.9]

# 실습1. 스핀들 회전수(RPM) 센서 배열 실습
rpm = np.array([1551, 1408, 1498, 1443, 1425, 1558, 2861, 1410])
print(rpm[0], rpm[-1])  # 1551 1410
print(rpm[1:4])  # [1408 1498 1443]
print(rpm[::2])  # [1551 1498 1425 2861]

# 실습2. 행, 열 단위로 추출하기
data = np.array([[1151, 42.8], [1408, 46.3], [2861, 4.6], [1410, 65.7]])
print(data[2])  # [2861.     4.6]
print(data[:, 0])  # [1151. 1408. 2861. 1410.]
print(data[:, 1])  # [42.8 46.3  4.6 65.7]
