import pandas as pd

df = pd.read_csv("data/16_diecasting.csv", encoding="utf-8")

# 실습6. describe로 격차 큰 컬럼 찾기
# describe 표에서 평균-중앙값 격차 큰 이상치 의심 컬럼 찾기

# 목표
# describe 표에서 이상치 의심 컬럼을 찾아 해석

# 단계
# · 여러 공정 컬럼을 describe로
print(df.describe())
# 샷       실린더압력  ...         형체력          상태
# count  202.000000  188.000000  ...  188.000000  202.000000
# mean    99.985149  234.308511  ...  303.106383    0.099010
# std     57.962286   32.118439  ...   56.164192    0.299417
# min      1.000000  108.000000  ...  222.000000    0.000000
# 25%     50.250000  215.750000  ...  255.000000    0.000000
# 50%     99.500000  218.000000  ...  258.000000    0.000000
# 75%    149.750000  265.000000  ...  363.000000    0.000000
# max    200.000000  265.000000  ...  384.000000    1.000000

# · 요약을 컬럼별로 정리하고 평균과 중앙값 격차 계산
report = df[["실린더압력", "주조압력", "사이클타임", "비스킷두께", "형체력"]].describe()
print(report)
# 실린더압력         주조압력  ...       비스킷두께         형체력
# count  188.000000   188.000000  ...  188.000000  188.000000
# mean   234.308511   848.696809  ...   14.170213  303.106383
# std     32.118439   244.726145  ...    3.661151   56.164192
# min    108.000000   255.000000  ...    2.000000  222.000000
# 25%    215.750000   595.000000  ...   11.000000  255.000000
# 50%    218.000000  1037.000000  ...   13.000000  258.000000
# 75%    265.000000  1052.000000  ...   17.000000  363.000000
# max    265.000000  1159.000000  ...   27.000000  384.000000

# .T 사용 시 describe 결과의 axis를 바꿈
# .T 사용한 이유는 아래에서 "격차"라는 새로운 컬럼 추가하기 위함
report2 = (
    df[["실린더압력", "주조압력", "사이클타임", "비스킷두께", "형체력"]].describe().T
)
print(report2)
#   count        mean  ...       75%     max
# 실린더압력  188.0  234.308511  ...   265.000   265.0
# 주조압력   188.0  848.696809  ...  1052.000  1159.0
# 사이클타임  188.0   64.750000  ...    35.925  6170.0
# 비스킷두께  188.0   14.170213  ...    17.000    27.0
# 형체력    188.0  303.106383  ...   363.000   384.0

# · 격차가 큰 순으로 정렬해 이상치 의심 컬럼 확인
# 격차라는 새로운 컬럼 추가해서 계산 결과들을 담기: 새로운 컬럼 이름을 언급하면 추가가 됨
# 그 다음에 격차 결과 순서로 정렬
report2["격차"] = (report2["mean"] - report2["50%"]).abs()

print(report2.sort_values("격차", ascending=False)[["mean", "max", "50%", "격차"]])
#               mean     max     50%          격차
# 주조압력   848.696809  1159.0  1037.0  188.303191
# 형체력    303.106383   384.0   258.0   45.106383
# 사이클타임   64.750000  6170.0    22.6   42.150000
# 실린더압력  234.308511   265.0   218.0   16.308511
# 비스킷두께   14.170213    27.0    13.0    1.170213


# 예상 결과
# 주조압력·형체력·사이클타임 등 격차 큰 컬럼 확인
