# 실습6. 특정 구간 추출 종합

import pandas as pd

df_shot = pd.read_csv("data/13_diecasting_shot.csv")

# 여러 feature 열을 선택한 뒤 iloc로 앞 구간 추출
cols = ["실린더압력", "주조압력", "사이클타임", "비스킷두께", "형체력"]
print(df_shot[cols].iloc[0:10])
#  실린더압력    주조압력  사이클타임  비스킷두께    형체력
# 0  214.0  1037.0   20.7   10.0  258.0
# 1  217.0  1052.0   20.7   11.0  257.0
# 2  214.0  1037.0   20.8   11.0  254.0
# 3  217.0  1052.0   20.6   11.0  253.0
# 4  217.0  1052.0   20.6   11.0  254.0
# 5  217.0  1052.0   20.6   11.0  257.0
# 6  215.0  1038.0   20.9   11.0  250.0
# 7  215.0  1038.0   20.9   11.0  258.0
# 8  215.0  1039.0   20.9   11.0  258.0
# 9  218.0  1053.0   20.8   12.0  257.0
print(df_shot[cols].iloc[0:10].shape)  # (10, 5)
# iloc이기 때문에 마지막 10은 출력 안함을 확인
# .csv에서 열 선택하고 iloc로 구간 추출함을 확인


# loc 라벨 범위로 두 열 구간 추출
cols2 = ["실린더압력", "주조압력"]
print(df_shot[cols2].loc[:2])
# 실린더압력    주조압력
# 0  214.0  1037.0
# 1  217.0  1052.0
# 2  214.0  1037.0
print(df_shot[cols2].loc[:2].shape)  # (3, 2)
# loc 라벨(실린더압력, 주조압력) 범위([:2])로
# 실린더압력과 주조압력의
# 0~2 인덱스만 출력됨을 확인

# iloc 위치 범위로 앞쪽 열 구간 추출
# .iloc(50:60, 0:6)
print(df_shot.iloc[50:60, 0:6])
# 샷  실린더압력    주조압력  사이클타임  비스킷두께    형체력
# 50  51  217.0  1051.0   20.8   11.0  258.0
# 51  52  214.0  1036.0   20.8   11.0  257.0
# 52  53  217.0  1051.0   20.7   11.0  258.0
# 53  54  217.0  1051.0   20.7   11.0  255.0
# 54  55  218.0  1053.0   20.7   11.0  255.0
# 55  56  217.0  1052.0   20.7   11.0  257.0
# 56  57  217.0  1052.0   20.7   11.0  258.0
# 57  58  214.0  1037.0   20.8   11.0  258.0
# 58  59  218.0  1053.0   20.8   11.0  253.0
# 59  60  218.0  1053.0   20.7   11.0  253.
print(df_shot.iloc[50:60, 0:6].shape)  # (10, 6)

# iloc(행, 열) 이므로, 행은 50~59까지, 열은 0~5까지 출력됨을 확인
