# 실습3. 한글, 구분자 깨짐 옵션 다루기
# encording과 sep으로 깨진 파일을 직접 해결

# 세미콜론 구분 파일
# sep 없이 읽으면 200행 1열, sep";"이면 200행 7열

import pandas as pd

df = pd.read_csv("data/12_metro_compressor_semicolon.csv", sep=";")
print(df.shape)  # (200, 1)
print(df.head(4))
# 측정시각;압축압력;배출압력;저장압력;오일온도;모터전류;가동상태
# 0    2020-02-27 06:38:47;9.3;-0.02;9.3;51.3;6.04;가동
# 1  2020-02-27 07:28:21;8.55;-0.02;8.55;56.8;0.04;정지
# 2  2020-02-27 08:17:54;8.67;-0.02;8.67;55.7;0.03;정지
# 3      2020-02-27 09:07:27;9.76;-0.02;9.76;;3.81;가동


# sep=";" 작성하고 실행했을 때 결과
#  측정시각  압축압력  배출압력  저장압력  오일온도  모터전류 가동상태
# 0  2020-02-27 06:38:47  9.30 -0.02  9.30  51.3  6.04   가동
# 1  2020-02-27 07:28:21  8.55 -0.02  8.55  56.8  0.04   정지
# 2  2020-02-27 08:17:54  8.67 -0.02  8.67  55.7  0.03   정지
# 3  2020-02-27 09:07:27  9.76 -0.02  9.76   NaN  3.81   가동
